[
  {
    "id": 0,
    "topic": "intro into hci",
    "title": "Intro bild und HCI",
    "author": "Mario",
    "body": "Ich frage mich, inwiefern dieses Bild einen Bezug zu Design und/oder human computer interaction hat. Soll keine Kritik sein, ich frage mich dies lediglich, vielleicht kann mich wer erleuchten.",
    "answers": [
      {
        "id": 0,
        "author": "Christian",
        "score": 4,
        "body": "@Mario - Also für mich sieht das aus wie eine Tischtennisplatte, auf der etwas draufprojiziert wurde, anstatt mit echten Bällen zu spielen. Erinnert mich an \"Laser Light Tennis\": https://www.youtube.com/watch?v=ZFDEnci3z8M#t=1m05s"
      },
      {
        "id": 1,
        "author": "Mario",
        "score": 3,
        "body": "@Christian - ahh cool seh schon! ok damit lässt sich was anfangen :) danke"
      },
      {
        "id": 2,
        "author": "Michael",
        "score": 3,
        "body": "@Mario - Für mich ist immer noch fraglich warum Fische auf den Tisch projeziert werden, die Wellen die sich ausbreiten sind ebenso nicht nachvollziehbar für mich. Gibt es dafür schon gute Ideen oder Begründungen? Würde mich interessieren beziehungsweise wie die anderen das so deuten. Liebe Grüße "
      },
      {
        "id": 3,
        "author": "peterpur",
        "score": 0,
        "body": "@Michael - http://makezine.com/2009/06/17/interactive-ping-pong-table/ "
      }
    ]
  },
  {
    "id": 1,
    "topic": "intro into hci",
    "title": "inter-disciplinary field slide confusing",
    "author": "Damjan",
    "body": "I think that the diagram is confusing and does not clearly differentiate between the fields; for example there is a label \"Interface Design\" and a label \"Application Design\" but it is not clear from the slide if Interface Design is a part of Application Design, Application Design is a part of Interface Design or they are completely independent. While the diagram may serve the purpose of illustrating the inter-disciplinary nature of HCI, I cannot find it anything but confusing and do not think that it is necessary. Maybe a simplified version which focuses only on the most important parts can show (or at least sketch, assuming that it is not important for every student to have an exact understanding of all the disciplines involved) the inter-disciplinary nature just as well, without the cognitive overload this diagram causes.",
    "answers": [
      {
        "id": 4,
        "author": "g0",
        "score": 2,
        "body": "@Damjan - I think what they want to express with this slide, is the fact that Human Computer Interaction is a fairly big and complicated field, and that our focus is on the red spot. It is true that visually is not very informative, but I would guess it follows Venn's diagram's rules. I don't think though they'll ever go into the details of this diagram, as in my opinion is not important, you shouldn't break your head on this one."
      },
      {
        "id": 5,
        "author": "Kristof",
        "score": 0,
        "body": " @Damjan - The slide was never meant to be educational, it was meant to give a slight idea how complex design can be."
      },
      {
        "id": 6,
        "author": "mnils",
        "score": 0,
        "body": "@Damjan - I agree that it's probably not suitable as an efficient or complete resource for finding exact definitions (it's an overview/teaser), but I don't think the example you pointed out is as ambiguous as you make it out to be: If you just look at it as a Venn diagram, Interface Design is the combination of Visual Design and Interaction Design. Application Design would thus consist of Interface Design and Information Architecture."
      }
    ]
  }
]
